app/Controllers/CatalogoController.php

SELECT *
FROM `recurso`
---
    public function index()
    {
        $categoriaModel = new CategoriaModel();
        $data['categorias'] = $categoriaModel->getAllCategorias();

        $idUsuario = session()->get('idUsuario');
        $recursoModel = new RecursoModel();
        $data['libros'] = $recursoModel->findAll();