app/Controllers/CategoriaController.php

SELECT *
FROM `categoria`
ORDER BY `idCategoria` ASC
---
    public function index(): string{
        $categoria = new CategoriaModel();

        $datos['categorias'] = $categoria->orderBy('idCategoria', 'ASC')->findAll();