app/Models/CategoriaModel.php

SELECT *
FROM `categoria`
ORDER BY `nombre` ASC
---
    public function getAllCategorias()
    {
        return $this->orderBy('nombre', 'ASC')->findAll();