app/Models/RecursoModel.php

SELECT `idRecurso`
FROM `prestamo`
WHERE `idUsuario` IS NULL
---
    public function getLibrosRecomendadosPorUsuario($idUsuario, $limite = 4)
    {
        $db = \Config\Database::connect();
        // Libros leídos por el usuario
        $prestados = $db->table('prestamo')
            ->select('idRecurso')
            ->where('idUsuario', $idUsuario)
            ->get()
            ->getResultArray();